results/ai-agent-continuous/logs/chaos-spike-logs/k6-chaos-spike-run3.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: -
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m40s max duration (incl. graceful stop):
              * default: Up to 50 looping VUs for 1m10s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 03/50 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 03/50 VUs  0m01.0s/1m10.0s

running (0m02.0s), 05/50 VUs, 1 complete and 0 interrupted iterations
default   [   3% ] 05/50 VUs  0m02.0s/1m10.0s

running (0m03.0s), 08/50 VUs, 5 complete and 0 interrupted iterations
default   [   4% ] 08/50 VUs  0m03.0s/1m10.0s

running (0m04.0s), 10/50 VUs, 11 complete and 0 interrupted iterations
default   [   6% ] 10/50 VUs  0m04.0s/1m10.0s

running (0m05.0s), 13/50 VUs, 26 complete and 0 interrupted iterations
default   [   7% ] 13/50 VUs  0m05.0s/1m10.0s

running (0m06.0s), 15/50 VUs, 43 complete and 0 interrupted iterations
default   [   9% ] 15/50 VUs  0m06.0s/1m10.0s

running (0m07.0s), 18/50 VUs, 59 complete and 0 interrupted iterations
default   [  10% ] 18/50 VUs  0m07.0s/1m10.0s

running (0m08.0s), 20/50 VUs, 79 complete and 0 interrupted iterations
default   [  11% ] 20/50 VUs  0m08.0s/1m10.0s

running (0m09.0s), 23/50 VUs, 104 complete and 0 interrupted iterations
default   [  13% ] 23/50 VUs  0m09.0s/1m10.0s

running (0m10.0s), 25/50 VUs, 128 complete and 0 interrupted iterations
default   [  14% ] 25/50 VUs  0m10.0s/1m10.0s

running (0m11.0s), 27/50 VUs, 153 complete and 0 interrupted iterations
default   [  16% ] 27/50 VUs  0m11.0s/1m10.0s

running (0m12.0s), 30/50 VUs, 179 complete and 0 interrupted iterations
default   [  17% ] 30/50 VUs  0m12.0s/1m10.0s

running (0m13.0s), 32/50 VUs, 208 complete and 0 interrupted iterations
default   [  19% ] 32/50 VUs  0m13.0s/1m10.0s

running (0m14.0s), 35/50 VUs, 238 complete and 0 interrupted iterations
default   [  20% ] 35/50 VUs  0m14.0s/1m10.0s

running (0m15.0s), 37/50 VUs, 271 complete and 0 interrupted iterations
default   [  21% ] 37/50 VUs  0m15.0s/1m10.0s

running (0m16.0s), 40/50 VUs, 306 complete and 0 interrupted iterations
default   [  23% ] 40/50 VUs  0m16.0s/1m10.0s

running (0m17.0s), 42/50 VUs, 341 complete and 0 interrupted iterations
default   [  24% ] 42/50 VUs  0m17.0s/1m10.0s

running (0m18.0s), 45/50 VUs, 370 complete and 0 interrupted iterations
default   [  26% ] 45/50 VUs  0m18.0s/1m10.0s

running (0m19.0s), 47/50 VUs, 401 complete and 0 interrupted iterations
default   [  27% ] 47/50 VUs  0m19.0s/1m10.0s

running (0m20.0s), 49/50 VUs, 431 complete and 0 interrupted iterations
default   [  29% ] 49/50 VUs  0m20.0s/1m10.0s

running (0m21.0s), 50/50 VUs, 468 complete and 0 interrupted iterations
default   [  30% ] 50/50 VUs  0m21.0s/1m10.0s

running (0m22.0s), 50/50 VUs, 487 complete and 0 interrupted iterations
default   [  31% ] 50/50 VUs  0m22.0s/1m10.0s

running (0m23.0s), 50/50 VUs, 530 complete and 0 interrupted iterations
default   [  33% ] 50/50 VUs  0m23.0s/1m10.0s

running (0m24.0s), 50/50 VUs, 551 complete and 0 interrupted iterations
default   [  34% ] 50/50 VUs  0m24.0s/1m10.0s

running (0m25.0s), 50/50 VUs, 588 complete and 0 interrupted iterations
default   [  36% ] 50/50 VUs  0m25.0s/1m10.0s

running (0m26.0s), 50/50 VUs, 614 complete and 0 interrupted iterations
default   [  37% ] 50/50 VUs  0m26.0s/1m10.0s

running (0m27.0s), 50/50 VUs, 659 complete and 0 interrupted iterations
default   [  39% ] 50/50 VUs  0m27.0s/1m10.0s

running (0m28.0s), 50/50 VUs, 684 complete and 0 interrupted iterations
default   [  40% ] 50/50 VUs  0m28.0s/1m10.0s

running (0m29.0s), 50/50 VUs, 712 complete and 0 interrupted iterations
default   [  41% ] 50/50 VUs  0m29.0s/1m10.0s

running (0m30.0s), 50/50 VUs, 746 complete and 0 interrupted iterations
default   [  43% ] 50/50 VUs  0m30.0s/1m10.0s

running (0m31.0s), 50/50 VUs, 778 complete and 0 interrupted iterations
default   [  44% ] 50/50 VUs  0m31.0s/1m10.0s

running (0m32.0s), 50/50 VUs, 811 complete and 0 interrupted iterations
default   [  46% ] 50/50 VUs  0m32.0s/1m10.0s

running (0m33.0s), 50/50 VUs, 845 complete and 0 interrupted iterations
default   [  47% ] 50/50 VUs  0m33.0s/1m10.0s

running (0m34.0s), 50/50 VUs, 873 complete and 0 interrupted iterations
default   [  49% ] 50/50 VUs  0m34.0s/1m10.0s

running (0m35.0s), 50/50 VUs, 918 complete and 0 interrupted iterations
default   [  50% ] 50/50 VUs  0m35.0s/1m10.0s

running (0m36.0s), 50/50 VUs, 949 complete and 0 interrupted iterations
default   [  51% ] 50/50 VUs  0m36.0s/1m10.0s

running (0m37.0s), 50/50 VUs, 981 complete and 0 interrupted iterations
default   [  53% ] 50/50 VUs  0m37.0s/1m10.0s

running (0m38.0s), 50/50 VUs, 1022 complete and 0 interrupted iterations
default   [  54% ] 50/50 VUs  0m38.0s/1m10.0s

running (0m39.0s), 50/50 VUs, 1038 complete and 0 interrupted iterations
default   [  56% ] 50/50 VUs  0m39.0s/1m10.0s

running (0m40.0s), 50/50 VUs, 1074 complete and 0 interrupted iterations
default   [  57% ] 50/50 VUs  0m40.0s/1m10.0s

running (0m41.0s), 50/50 VUs, 1109 complete and 0 interrupted iterations
default   [  59% ] 50/50 VUs  0m41.0s/1m10.0s

running (0m42.0s), 50/50 VUs, 1143 complete and 0 interrupted iterations
default   [  60% ] 50/50 VUs  0m42.0s/1m10.0s

running (0m43.0s), 50/50 VUs, 1185 complete and 0 interrupted iterations
default   [  61% ] 50/50 VUs  0m43.0s/1m10.0s

running (0m44.0s), 50/50 VUs, 1218 complete and 0 interrupted iterations
default   [  63% ] 50/50 VUs  0m44.0s/1m10.0s

running (0m45.0s), 50/50 VUs, 1251 complete and 0 interrupted iterations
default   [  64% ] 50/50 VUs  0m45.0s/1m10.0s

running (0m46.0s), 50/50 VUs, 1292 complete and 0 interrupted iterations
default   [  66% ] 50/50 VUs  0m46.0s/1m10.0s

running (0m47.0s), 50/50 VUs, 1328 complete and 0 interrupted iterations
default   [  67% ] 50/50 VUs  0m47.0s/1m10.0s

running (0m48.0s), 50/50 VUs, 1361 complete and 0 interrupted iterations
default   [  69% ] 50/50 VUs  0m48.0s/1m10.0s

running (0m49.0s), 50/50 VUs, 1382 complete and 0 interrupted iterations
default   [  70% ] 50/50 VUs  0m49.0s/1m10.0s

running (0m50.0s), 50/50 VUs, 1426 complete and 0 interrupted iterations
default   [  71% ] 50/50 VUs  0m50.0s/1m10.0s

running (0m51.0s), 50/50 VUs, 1461 complete and 0 interrupted iterations
default   [  73% ] 50/50 VUs  0m51.0s/1m10.0s

running (0m52.0s), 50/50 VUs, 1493 complete and 0 interrupted iterations
default   [  74% ] 50/50 VUs  0m52.0s/1m10.0s

running (0m53.0s), 50/50 VUs, 1524 complete and 0 interrupted iterations
default   [  76% ] 50/50 VUs  0m53.0s/1m10.0s

running (0m54.0s), 50/50 VUs, 1571 complete and 0 interrupted iterations
default   [  77% ] 50/50 VUs  0m54.0s/1m10.0s

running (0m55.0s), 50/50 VUs, 1596 complete and 0 interrupted iterations
default   [  79% ] 50/50 VUs  0m55.0s/1m10.0s

running (0m56.0s), 50/50 VUs, 1638 complete and 0 interrupted iterations
default   [  80% ] 50/50 VUs  0m56.0s/1m10.0s

running (0m57.0s), 50/50 VUs, 1663 complete and 0 interrupted iterations
default   [  81% ] 50/50 VUs  0m57.0s/1m10.0s

running (0m58.0s), 50/50 VUs, 1700 complete and 0 interrupted iterations
default   [  83% ] 50/50 VUs  0m58.0s/1m10.0s

running (0m59.0s), 50/50 VUs, 1732 complete and 0 interrupted iterations
default   [  84% ] 50/50 VUs  0m59.0s/1m10.0s

running (1m00.0s), 50/50 VUs, 1770 complete and 0 interrupted iterations
default   [  86% ] 50/50 VUs  1m00.0s/1m10.0s

running (1m01.0s), 50/50 VUs, 1797 complete and 0 interrupted iterations
default   [  87% ] 50/50 VUs  1m01.0s/1m10.0s

running (1m02.0s), 43/50 VUs, 1838 complete and 0 interrupted iterations
default   [  89% ] 43/50 VUs  1m02.0s/1m10.0s

running (1m03.0s), 41/50 VUs, 1873 complete and 0 interrupted iterations
default   [  90% ] 41/50 VUs  1m03.0s/1m10.0s

running (1m04.0s), 33/50 VUs, 1908 complete and 0 interrupted iterations
default   [  91% ] 33/50 VUs  1m04.0s/1m10.0s

running (1m05.0s), 28/50 VUs, 1939 complete and 0 interrupted iterations
default   [  93% ] 28/50 VUs  1m05.0s/1m10.0s

running (1m06.0s), 23/50 VUs, 1971 complete and 0 interrupted iterations
default   [  94% ] 23/50 VUs  1m06.0s/1m10.0s

running (1m07.0s), 17/50 VUs, 1999 complete and 0 interrupted iterations
default   [  96% ] 17/50 VUs  1m07.0s/1m10.0s

running (1m08.0s), 12/50 VUs, 2025 complete and 0 interrupted iterations
default   [  97% ] 12/50 VUs  1m08.0s/1m10.0s

running (1m09.0s), 07/50 VUs, 2039 complete and 0 interrupted iterations
default   [  99% ] 07/50 VUs  1m09.0s/1m10.0s

running (1m10.0s), 01/50 VUs, 2051 complete and 0 interrupted iterations
default   [ 100% ] 01/50 VUs  1m10.0s/1m10.0s


  █ TOTAL RESULTS 

    checks_total.......: 2052   29.160487/s
    checks_succeeded...: 50.43% 1035 out of 2052
    checks_failed......: 49.56% 1017 out of 2052

    ✗ Normal checkout processed
      ↳  0% — ✓ 0 / ✗ 1017
    ✓ Malicious checkout rejected

    HTTP
    http_req_duration..............: avg=335.21ms min=143.6ms  med=292.93ms max=1.56s p(90)=578.4ms  p(95)=652.16ms
      { expected_response:true }...: avg=323.68ms min=143.6ms  med=284.62ms max=1.13s p(90)=576.68ms p(95)=647.42ms
    http_req_failed................: 25.00% 2052 out of 8208
    http_reqs......................: 8208   116.641949/s

    EXECUTION
    iteration_duration.............: avg=1.35s    min=614.83ms med=1.38s    max=2.8s  p(90)=1.8s     p(95)=1.92s   
    iterations.....................: 2052   29.160487/s
    vus............................: 1      min=1            max=50
    vus_max........................: 50     min=50           max=50

    NETWORK
    data_received..................: 66 MB  934 kB/s
    data_sent......................: 520 MB 7.4 MB/s



running (1m10.4s), 00/50 VUs, 2052 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/50 VUs  1m10s